{
  "endings": [
    {
      "character": "Farmer",
      "id": "farmer_resist_eradication",
      "title": "Armed Resistance: The Terrorism Trap",
      "narrative": "You resisted. Others joined you—farmers who'd had enough. The confrontation turned violent. You threw rocks; they fired tear gas. Then live ammunition. Three farmers died, two police officers injured. You fled into the jungle, but they found you within a week. Now you face terrorism charges under Peru's counterinsurgency laws—not drug trafficking charges, terrorism charges, with 20-to-life minimum. The coca was just farming; resistance made you an 'insurgent.' Your family has been displaced, your home destroyed in the operation. Between 2010-2020, 47 people died in eradication confrontations in Peru. You're now one more statistic in the drug war's body count.",
      "legal_info": {
        "title": "Eradication Resistance and Counterterrorism Law",
        "text": "Peru Penal Code Article 319: Resistance with violence against public authority = 2-4 years. BUT: resistance during drug-related operations often prosecuted under counterterrorism legislation (Decree Law 25475, modified by Law 30077). Terrorism charges require: (1) use of violence, (2) intent to create social alarm, (3) organized action. Penalty: 20 years to life. In practice, eradication resistance is often categorized as terrorism rather than simple resistance. Colombia similarly applies internal enemy frameworks to coca growers who resist. Between 2010-2020: 47 deaths in eradication confrontations in Peru (CORAH reports). 2019-2022: 13 deaths in Colombia. Bolivia eliminated forced eradication in 2008; violent confrontations ceased."
      },
      "policy_comparison": {
        "countries": [
          {
            "name": "Peru",
            "policy": "Forced manual eradication by CORAH (Proyecto Especial de Control y Reducción de Cultivos Ilegales en el Alto Huallaga). Military and police escort. Confrontations criminalized as terrorism. 2022: 25,486 hectares eradicated. 2010-2020: 47 deaths.",
            "penalty": "Resistance during eradication = terrorism charges (20 years to life). Drug trafficking = 8-15 years minimum."
          },
          {
            "name": "Colombia",
            "policy": "Forced eradication continues despite 2016 peace accord commitment to voluntary substitution. Manual eradication teams with military escort. Resistance is prosecuted. 2019-2022: 13 deaths in confrontations. Substitution program undermined by budget cuts.",
            "penalty": "Resistance = aggravated assault on public officials (8-15 years). Cultivation = 4-12 years. Historical conflation of peasants with guerrillas."
          },
          {
            "name": "Bolivia",
            "policy": "Forced eradication ELIMINATED in 2008 under Evo Morales. Community-controlled monitoring through coca growers' unions. Violence stopped. Model: 22,000 hectares legal coca, community self-regulation. No confrontations, no deaths since 2008.",
            "penalty": "No resistance charges because no forced eradication. Excess cultivation addressed through community pressure, not military action."
          }
        ]
      },
      "data_visualization_note": "Show eradication deaths timeline: Peru (47), Colombia (13+), Bolivia (0 since 2008). Map eradication zones and resistance incidents. Demonstrate correlation between forced eradication policy and violence. Include policy timeline showing Bolivia's 2008 shift."
    },
    {
      "character": "Farmer",
      "id": "farmer_hide_crop_arrested",
      "title": "Caught Hiding: The Concealment Gambit",
      "narrative": "You hid the coca in the ravine, covered it with vegetation, hoped the eradication team wouldn't search that far. They did. Satellite imagery, informant tips, systematic grid searches—they found it. Attempting to conceal illegal crops is treated as aggravating evidence of intentional criminality. You're arrested for drug trafficking (not just cultivation—they assume production intent). Eight to fifteen years minimum. Your family loses your labor, your income, and faces social stigma. The hidden coca was discovered anyway, but now you've also lost years of your life to prison. Your wife must manage the farm alone; your children will grow up visiting you behind bars. The concealment strategy, employed by many farmers, rarely works and always makes legal consequences worse.",
      "legal_info": {
        "title": "Concealment as Aggravating Factor",
        "text": "Peru Penal Code Article 296: Drug trafficking (including coca cultivation for cocaine) = 8-15 years minimum, 25-35 maximum. Concealment of illegal crops is treated as evidence of intentional criminal activity rather than economic necessity. Satellite surveillance (UNODC-supported) makes detection highly probable. Informant networks in coca-growing communities are extensive. Concealment attempts often result in harsher sentences because they demonstrate awareness of illegality and premeditation. Defense of 'economic necessity' is weakened by evidence of concealment efforts."
      },
      "policy_comparison": {
        "countries": [
          {
            "name": "Peru",
            "policy": "Satellite monitoring + eradication teams + extensive informant networks. Concealment discovered in majority of cases. Treated as aggravating factor in prosecution.",
            "penalty": "Drug trafficking: 8-15 years minimum. Concealment may increase sentence within statutory range."
          },
          {
            "name": "Colombia",
            "policy": "Aerial surveillance + ground verification. Concealment is common but detection rates are high. Paramilitaries and criminal organizations also monitor/control coca cultivation areas.",
            "penalty": "Cultivation: 4-12 years. Concealment treated as evidence of trafficking rather than simple cultivation."
          },
          {
            "name": "Bolivia",
            "policy": "Community monitoring system eliminates need for concealment. Legal cultivation limit (22,000 hectares) allows transparent growing. Excess is managed through community pressure. No satellite surveillance of individual farmers.",
            "penalty": "Cultivation above legal limit addressed through community mechanisms, not criminal prosecution."
          }
        ]
      },
      "data_visualization_note": "Show detection rates of concealed coca over time. Map satellite surveillance coverage in Andean region. Compare detection technology investment vs. alternative development investment."
    },
    {
      "character": "Farmer",
      "id": "farmer_eradication_accepted_poverty",
      "title": "Eradication Accepted: The Displacement Cycle",
      "narrative": "You accepted eradication. No violence, no resistance—they destroyed your crops and left. Now what? You still have the same debts, the same family to feed, the same economic desperation that drove you to coca. The government offered no compensation, no alternative livelihood support. Three months later, you're back to planting coca, but this time in a more remote location, deeper in the forest. This is the displacement pattern: eradication doesn't stop cultivation, it relocates it. Your new plot required clearing virgin rainforest. The environmental damage is worse, the location more isolated, the connection to trafficking networks more direct. Accepting eradication without resisting made you compliant in the moment, but solved nothing. The cycle continues—cultivation, eradication, displacement, cultivation.",
      "legal_info": {
        "title": "Eradication Without Alternatives: The Displacement Effect",
        "text": "Peru's eradication strategy: destroy coca crops without addressing economic drivers. No compensation provided for destroyed crops (policy choice—compensation would 'incentivize' coca). Alternative development programs reach only 15-20% of coca farmers. Geographical displacement pattern: eradication in accessible areas → cultivation moves to remote zones → deforestation increases → trafficking networks adapt. Studies show cultivation is rarely eliminated, only relocated. Remote areas: more deforestation, more forest degradation, more direct involvement with traffickers (less farmer autonomy). Peru 2022: 95,000 hectares under cultivation despite decades of eradication."
      },
      "policy_comparison": {
        "countries": [
          {
            "name": "Peru",
            "policy": "Forced eradication without compensation or guaranteed alternatives. 2022: 25,486 hectares eradicated, but total cultivation area remains around 95,000 hectares. Displacement effect documented but policy continues unchanged.",
            "penalty": "Eradication is administrative (destruction of crops). Subsequent cultivation is criminal (8-15 years if detected)."
          },
          {
            "name": "Colombia",
            "policy": "Similar displacement pattern. 2016 peace accord promised voluntary substitution with economic support, but implementation has been weak. Forced eradication continues in many areas. Cultivation relocates to more remote regions.",
            "penalty": "Displacement into national parks or protected areas increases legal penalties. Eradication without alternatives drives recultivation."
          },
          {
            "name": "Bolivia",
            "policy": "Legal cultivation allowed (22,000 hectares), eliminating displacement pressure for farmers within legal limits. Community self-regulation prevents need for forced eradication. Geographical stability—farmers stay in traditional areas.",
            "penalty": "No displacement effect because legal cultivation is permitted within limits. Excess addressed through community mechanisms."
          }
        ]
      },
      "data_visualization_note": "Show cultivation displacement maps: eradication zones → new cultivation areas → deforestation. Timeline showing eradication efforts vs. total cultivation area (demonstrating ineffectiveness). Environmental cost of displacement (forest loss)."
    },
    {
      "character": "Farmer",
      "id": "farmer_enaco_permits_bureaucracy",
      "title": "Legal Coca, Bureaucratic Nightmare",
      "narrative": "You spent six months obtaining ENACO permits. Documentation, bureaucratic appointments, fees, trips to the regional office. You finally have legal authorization to grow coca for traditional use. But ENACO pays 40% below black market prices and only purchases at irregular intervals. The paperwork requirements continue: harvest reports, transportation permits, storage documentation. You're legal, but barely surviving. Your neighbor without permits earns twice what you do with half the paperwork. The legal coca pathway exists in theory, but in practice it's designed for failure—low prices, high bureaucracy, limited market access. You've avoided criminal prosecution, but you've also locked yourself into poverty. How long can you sustain this when illegal cultivation is so much more lucrative and your family is still struggling?",
      "legal_info": {
        "title": "ENACO Legal Coca System in Peru",
        "text": "ENACO (Empresa Nacional de la Coca): state monopoly established 1949 for legal coca trade. Traditional coca use (chewing, tea) is constitutionally protected (Article 2, Peru Constitution). Legal cultivation restricted to designated areas. Permits required: documentation intensive, processing time 3-6 months, various fees. ENACO purchase prices: typically 40-60% below black market. Purchase frequency: irregular, dependent on demand. Farmers complain of bureaucratic burden and low profitability. Result: many permit-holders eventually sell to black market despite legal status. Comparison—Bolivia: allows 22,000 hectares legal coca, community-controlled, higher prices, less bureaucracy. Bolivia's model shows legal coca is viable when properly structured."
      },
      "policy_comparison": {
        "countries": [
          {
            "name": "Peru",
            "policy": "ENACO monopoly on legal coca. Restrictive, bureaucratic, low prices. Legal market captured approximately 15,000-20,000 hectares (vs 95,000 illegal). System discourages legal participation through structural obstacles.",
            "penalty": "Legal coca sale to illegal market = drug trafficking (8-15 years). Farmers with permits who sell outside ENACO face same penalties as illegal growers."
          },
          {
            "name": "Bolivia",
            "policy": "22,000 hectares legal coca allowed by Law 1008 (revised by Law 906). Community-controlled through coca growers' unions. Market prices closer to black market rates. Less bureaucratic burden. Legal coca integrated into economy and culture.",
            "penalty": "Cultivation beyond 22,000 hectares managed through community pressure and administrative measures. Criminal penalties exist but rarely applied to small-scale farmers."
          },
          {
            "name": "Colombia",
            "policy": "No legal coca market. All coca cultivation criminalized regardless of traditional use. Indigenous communities have limited exceptions, but enforcement inconsistent. No ENACO equivalent.",
            "penalty": "All coca cultivation = 4-12 years imprisonment. No legal pathway for small farmers."
          }
        ]
      },
      "data_visualization_note": "Compare ENACO prices vs. black market prices over time (price differential). Show bureaucratic steps required for legal coca vs. illegal sale (complexity comparison). Map legal vs. illegal cultivation areas (geographical segregation)."
    },
    {
      "character": "Farmer",
      "id": "farmer_informant_witness_protection",
      "title": "The Informant: Witness Protection Isolation",
      "narrative": "You reported the cocaine lab to the authorities. They raided it, arrested five people, destroyed the equipment. Your identity was supposed to be protected—it wasn't. Within two weeks, everyone knew. Your family received threats. The police offered witness protection: relocation to a different region, new identity, minimal financial support. You accepted. Now you're living in a small town on the coast, far from the mountains you know, far from your community, far from your language (everyone here speaks Spanish, you think in Quechua). Your children are in a new school where they're outsiders. You have no land, no livelihood, no social network. The financial support from witness protection will end in six months. You did 'the right thing' according to the state, but you've lost everything—your home, your community, your identity, your economic base. You're safe from retaliation but socially dead. Was cooperation worth this isolation?",
      "legal_info": {
        "title": "Witness Protection in Drug Cases",
        "text": "Peru Law 27378 (2000): Witness and Collaborator Protection Program. Provisions: identity protection, relocation, temporary financial support, security measures. In practice: underfunded, inconsistent implementation, limited duration of support (typically 6-24 months). Rural informants face particular challenges: relocation from rural to urban areas, language barriers (Quechua/Aymara to Spanish-dominant areas), loss of agricultural livelihood, social isolation. Retaliation risks: drug trafficking organizations have extensive intelligence networks, informant identification is common despite protection measures. Effectiveness debatable: many potential witnesses refuse cooperation due to inadequate protection. Approximately 15% of protected witnesses return to original communities within 5 years (facing retaliation risk)."
      },
      "policy_comparison": {
        "countries": [
          {
            "name": "Peru",
            "policy": "Witness protection exists but underfunded and limited. Relocation support minimal. Program prioritizes high-level cases; small farmer cooperation receives less protection. Rural-to-urban relocation common, creating livelihood crisis.",
            "penalty": "Cooperation theoretically reduces sentences for co-defendants, but farmer-informants rarely benefit (they're usually not charged themselves). Protection is primary incentive."
          },
          {
            "name": "Colombia",
            "policy": "More developed witness protection program due to decades of cartel violence and guerrilla warfare. Still insufficient for rural informants. Paramilitaries and cartels have historically targeted witnesses effectively. Many protection program participants still killed.",
            "penalty": "Cooperation can reduce sentences for co-defendants. Protection program is better funded than Peru's but still faces capacity issues."
          },
          {
            "name": "Bolivia",
            "policy": "Community-controlled coca monitoring reduces need for external informants. Community members regulate excess cultivation through social pressure rather than state cooperation. Less state involvement = less informant requirement.",
            "penalty": "Informant protection less relevant in community-based regulatory model. Social regulation replaces state enforcement."
          }
        ]
      },
      "data_visualization_note": "Show witness protection program capacity vs. need (participation rates, dropout rates). Map relocation patterns (rural origin to urban destination). Interview quotes from protected witnesses (anonymized) about social costs of cooperation."
    },
    {
      "character": "Farmer",
      "id": "farmer_cooperative_survival",
      "title": "The Cooperative: Collective Struggle, Uncertain Survival",
      "narrative": "You joined the coffee cooperative with fifteen other families. Together you negotiated better prices, shared equipment, and accessed fair trade certification. It's been three years. Some months are better than others—when the cooperative gets good contracts, everyone benefits. But it's fragile. Five families have already left for coca or migration. The cooperative requires constant work: meetings, financial transparency, collective decision-making, market research. You're still poor, but you have dignity, community, and hope that collective organization might eventually work. The cooperative's success depends on factors beyond your control: international coffee prices, fair trade market access, government support (minimal), and NGO funding (inconsistent). You're surviving through solidarity, but barely. This is the precarious space of legal agriculture in coca regions—possible but difficult, collective but uncertain.",
      "legal_info": {
        "title": "Cooperative Models in Coca-Growing Regions",
        "text": "Agricultural cooperatives: collective organization model providing shared resources, bargaining power, market access. In Peru's coca regions: cooperatives face severe challenges including price volatility, limited capital, competition from coca income, member attrition. Success rates: approximately 30% survive long-term (5+ years). Success factors: external funding (NGO/government), fair trade certification, market connections, strong leadership, member commitment. Peru government cooperative support: minimal (Agrobanco provides some credit, but eligibility strict). Coffee cooperative average: 20-30 members, fair trade prices 10-20% above conventional. Still insufficient to match coca income. Cooperatives are defensive strategy against poverty and predatory intermediaries, not prosperity strategy."
      },
      "policy_comparison": {
        "countries": [
          {
            "name": "Peru",
            "policy": "Cooperative model exists but receives minimal state support. Fair trade certification helps but limited market access. Government prioritizes eradication over cooperative development funding (eradication: $200M/year, cooperative support: ~$5M/year).",
            "penalty": "No penalty for cooperative membership. However, individual members caught with coca face same penalties regardless of cooperative participation."
          },
          {
            "name": "Colombia",
            "policy": "Peace accord (2016) included cooperative development support for post-conflict rural areas. Implementation inconsistent. Some cooperatives receive support; others abandoned. Government invests in rural infrastructure: roads, markets, credit.",
            "investment": "Peace accord allocates resources to rural development. Cooperative formation encouraged. Infrastructure investment facilitates market access."
          },
          {
            "name": "Bolivia",
            "policy": "Strong cooperative tradition, especially in coca-growing regions. Cocalero unions function as cooperatives: collective political power, market control, community regulation. State supports cooperative model as part of social economy vision.",
            "investment": "Cooperative model integrated into governance. Community control of coca monitoring through cooperatives. Political and economic support."
          }
        ]
      },
      "data_visualization_note": "Show cooperative success rates vs. state investment across countries. Demonstrate that cooperatives with adequate support have higher success rates. Include timeline showing cooperative formation, struggle, potential success."
    },
    {
      "character": "Farmer",
      "id": "farmer_urban_migration",
      "title": "The Migrant: Landless in Lima",
      "narrative": "You sold your land for $8,000—a fraction of its value—and moved the family to Lima. Your agricultural skills are worthless in the city. You find work in construction: daily wages, no benefits, no job security. Your wife sells snacks on the street. You live in a one-room addition to a relative's house in Villa El Salvador, a sprawling slum. Your children adapted better than you—they're in school, learning city ways, losing their Quechua, forgetting the mountains. You're 45 years old and started over with nothing. Sometimes you dream about your land, your coca-growing neighbor who stayed, the mountains. You escaped poverty for different poverty. Your family survives, but you've lost your identity, your livelihood, your connection to the land your grandfather cleared. Was this progress, or just rearranging your suffering?",
      "legal_info": {
        "title": "Rural-Urban Migration: Scale and Consequences",
        "text": "Peru's rural-urban migration: accelerated by economic crisis in agriculture. Approximately 25% of rural farmers in coca-growing regions migrate to cities (primarily Lima, Ayacucho, Cusco, Pucallpa). Push factors: agricultural unprofitability, debt, lack of services, violence (where present), eradication. Urban outcomes: informal economy employment (construction, street vending, domestic work, services), low wages ($200-400/month), no labor protections, precarious housing. Migrant communities concentrated in peripheral slums (conos): Villa El Salvador, Villa María del Triunfo, San Juan de Lurigancho. Social costs: loss of indigenous language and culture, family separation, identity crisis for older migrants. Economic outcome: persistent poverty, but different form—urban informal poverty vs. rural agricultural poverty."
      },
      "policy_comparison": {
        "countries": [
          {
            "name": "Peru",
            "policy": "Rural-urban migration is massive and continuous. Lima population: 10+ million, majority from rural migration. Government response: minimal support for migrant integration. Urban informal economy absorbs rural displaced population without legal protections.",
            "penalty": "Migration is legal and common. Informal urban work is technically illegal (unlicensed vendors, unregistered construction workers) but widely tolerated."
          },
          {
            "name": "Colombia",
            "policy": "Similar migration pattern, compounded by armed conflict displacement. Major cities (Bogotá, Medellín, Cali) absorbed millions of rural migrants. Urban poverty rates high. Peace accord includes rural development to reduce migration pressure.",
            "penalty": "Migration is legal. Informal urban work is widespread. Displaced persons have some legal protections (Law 1448) but implementation weak."
          },
          {
            "name": "Bolivia",
            "policy": "Rural-urban migration exists but less extreme. El Alto (adjacent to La Paz) has absorbed rural migrants. Difference: legal coca cultivation allows rural economic viability for some farmers, reducing migration pressure. Indigenous cultural maintenance stronger in urban Bolivia.",
            "penalty": "Migration is legal and culturally managed through indigenous community networks extending into cities."
          }
        ]
      },
      "data_visualization_note": "Show rural-to-urban migration flows from coca regions to major cities. Lima slum expansion timeline (spatial growth). Economic comparison: rural agricultural poverty vs. urban informal poverty (same poverty, different location). Language loss data among migrant children (cultural cost)."
    },
    {
      "character": "Farmer",
      "id": "farmer_loan_default_landless",
      "title": "Debt Default: The Land Seizure Trap",
      "narrative": "You couldn't pay the loan. The merchant came with his paperwork—you'd signed a document putting your land up as collateral without fully understanding the terms (it was in Spanish legal language, you read Quechua). He took your five hectares. Your grandfather cleared that land, your father farmed it, you grew up there. Now it belongs to a middleman who will plant coca on it—the very crop you tried to avoid. You're landless. Your family moves to a smaller plot rented from a relative. You work as a day laborer on others' farms. Your children's inheritance is gone. The cruel irony: the land you lost trying to avoid coca is now growing coca, but the profits go to someone else. This is the coca economy's second mechanism—not just cultivation, but land accumulation through debt. You became landless in the system designed to help you stay legal.",
      "legal_info": {
        "title": "Informal Lending and Land Seizure Mechanisms",
        "text": "Rural credit crisis: formal banking rarely serves small farmers in coca regions (perceived risk, lack of collateral, distance). Informal lending fills gap: local merchants, traders, moneylenders. Interest rates: 10-20% per month (120-240% annually). Collateral: land. Legal framework: ambiguous. Informal debt contracts have questionable legal status, but enforcement occurs through social pressure and extra-legal mechanisms. Land seizure: common outcome of default. Land title transfer often occurs through intimidation or barely legal contracts. Result: land concentration—middlemen and traders accumulate farmland, often use it for coca cultivation. Studies show significant correlation between debt default and coca expansion (new landowners plant coca). State response: minimal. Rural credit market is unregulated, predatory lending is widespread but unprosecuted."
      },
      "policy_comparison": {
        "countries": [
          {
            "name": "Peru",
            "policy": "Informal rural lending is widespread and unregulated. Legal protections for borrowers are minimal. Land seizure through debt is common. State agricultural credit (Agrobanco) reaches <10% of farmers. Predatory lending and land accumulation through debt is documented but not addressed.",
            "penalty": "No legal protection for borrowers in informal credit. Land loss is civil matter, rarely litigated. Usury laws exist but not enforced."
          },
          {
            "name": "Colombia",
            "policy": "Similar informal lending crisis. Armed actors (paramilitaries, guerrillas) historically involved in land appropriation through debt/violence. Post-conflict land restitution efforts (Law 1448) attempt to address historical dispossession. Rural credit access remains limited.",
            "penalty": "Land seizure through debt is often linked to armed actors. Legal remedies exist but accessing them is difficult for rural poor."
          },
          {
            "name": "Bolivia",
            "policy": "Cooperative credit systems more developed. Rural banking has better reach. Legal coca income provides more stable economic base, reducing desperation borrowing. Cooperative structure makes predatory lending more difficult. Not perfect but better protection.",
            "penalty": "Cooperative structure makes predatory lending more difficult. Not perfect but better protection."
          }
        ]
      },
      "data_visualization_note": "Show land ownership changes in coca-growing regions 2000-2023: concentration trend. Map showing former farmer-owned land now in hands of traders/middlemen. Demonstrate link between debt, land loss, and coca expansion (new owners plant coca on acquired land)."
    },
    {
      "character": "Farmer",
      "id": "farmer_altdev_waiting",
      "title": "Enrolled and Waiting: The Alternative Development Gap",
      "narrative": "You enrolled in the alternative development program eight months ago. You attended the orientation, submitted all documentation, met the DEVIDA technician twice. You're waiting. The first payment ($400) was supposed to arrive after three months—it's been eight. When you call, they say 'processing.' Meanwhile, your loan is still due, your children still need to eat, and the coca middlemen still visit. You've planted the coffee seedlings they recommended, but those take three years to produce. Your neighbor who stayed with coca bought a motorcycle last month. How long can you wait? This is the 'alternative development gap'—the space between promise and reality, where good intentions fail and farmers return to coca. You're trying to do the right thing, but the system makes the wrong thing far easier.",
      "legal_info": {
        "title": "Alternative Development Implementation Gaps",
        "text": "Peru DEVIDA program structure: (1) Enrollment: documentation and verification (2-4 months); (2) First payment: theoretically 3 months post-enrollment, in practice 6-12 months; (3) Technical assistance: sporadic visits, often <3 per year; (4) Market linkages: limited and inconsistent; (5) Total support: $1,000-2,000 over 2 years. Critical gap: temporal mismatch between immediate economic needs and long-term agricultural development. Alternative crops (coffee, cacao) take 3-5 years to full production. Program provides support for 2 years. Families must survive the intervening period. Only 30% remain in legal crops after 5 years. Failures typically occur in first 2 years during 'waiting period.' Program design assumes debt-free starting point (rarely true). Payment delays exacerbate problem. Insufficient support during critical transition period drives families back to coca."
      },
      "policy_comparison": {
        "countries": [
          {
            "name": "Peru",
            "policy": "DEVIDA alternative development program: $1,000-2,000 per family over 2 years. Implementation gaps: payment delays, insufficient technical assistance, weak market linkages. Dropout rate: ~70% in first 2 years. Funding: ~$50-70 million/year (compare to $200M for eradication).",
            "investment": "Alternative development is underfunded relative to enforcement. Per-hectare investment: ~$1,500-2,000. Insufficient for sustainable transition."
          },
          {
            "name": "Colombia",
            "policy": "Peace accord (2016) promised comprehensive rural development: $1.8 billion for alternative development. Implementation: slow and incomplete. PNIS (substitution program) enrolled 99,000 families. Payment delays, incomplete technical assistance. Many families returned to coca. Program design better than Peru (higher payments, longer duration) but implementation problems similar.",
            "investment": "Peace accord commitments: $1.8B. Actual disbursement: much lower. Per-family support theoretically $12,000 over 5 years. Payment delays undermine program."
          },
          {
            "name": "Bolivia",
            "policy": "Integrated approach: legal coca (22,000 hectares) + crop diversification for excess producers. No temporal gap—farmers can maintain legal coca while developing alternatives. Community-controlled transition. Higher success rates because economic pressure is reduced.",
            "investment": "Integrated model reduces need for substitute-only programs. Legal coca provides baseline income stability during transition to alternatives."
          }
        ]
      },
      "data_visualization_note": "Show dropout curve: 70% leave program in years 1-2. Compare Peru/Colombia dropout curves vs. Bolivia's integrated model success."
    }
  ]
}